package HomeWork.Lesson_10;
/* Создайте пакет р1, в нем класс А. В пакете р1 создайте подпакет р2, в нём класс В со static элементами. В подпакете р2 подпакет р3 в нём класс С
* Создайте новый пакет р4, в нём класс D. В пакете р4 создайте подпакет p5, в нём класс Е. Внутри класса D напишите код, который будет задействовать
* Любые элементы классов А, С, Е, а также static элементы класса В. Используя выражения import static, работайте с неполными именами классов. */

public class A {
 public String abc = "Zdradsvuy drug!";

 }



