package HomeWork;
// 1. Создайте класс, в котором будет 5 overloaded методов, которые вычесляют сумму нуля, одного, двух, трех и четырёх
// целых чисел, соответственно передают эту сумму в output и выводит её на экран. В случае когда слагаемые отсутствуют
// (т.е. когда параметров нет) сумма пусть равнятся 0.
// 2. Измените класс student, чтобы имел 3 конструктора. 1-ый принимает все параметры. 2-ой только id, name, surname, corse.
// 3-тий не принимает значений. Создайте в StudentTest 3 объекта с помощью разных конструкторов.

public class Lesson_6 {

}
