package HomeWork.Lesson_21;
/* Cоздайте класс student со следующими переменными: name (используйте StringBuilder)
corse, grade. Примените инкапсуляцию к данному классу. Длина имени объектов не должна
быть менее 3-х символов, оценки должны быть числами в интервале от 1-10, курс должен быть числом от 1-4
включительно. Создайте метод showinfo, который будет выводить всю информацию о студенте,
не используя переменную класса напрямую. Создайте класс TestStudent, в котором создайте
объект класса Student, придайте его переменным значение. Произведите метод showinfo.
 */
public class Student {
}
